from tkinter import *
from tkinter.ttk import *
import tkinter.messagebox
import main

win = Tk()  # 창생성
win.geometry("400x700")
win.title("마이잡 프로그램")
win.option_add("*font", "맑은고딕 15")

# 제목
lab1 = Label(win)
lab1.config(text="My Job")
lab1.pack()


def searching():
    # 첫번째 근무지(필수)
    region1 = cb1.get()
    sRegion1 = cb02.get()
    if (sRegion1 == "첫번째 근무지역 세부 선택"):
        sRegion1 = ""

    # 두번째 근무지
    region2 = cb3.get()
    if (region2 == "두번째 근무지역 선택"):
        region2 = ""
    sRegion2 = cb04.get()
    if (sRegion2 == "두번째 근무지역 세부 선택"):
        sRegion2 = ""

    # 세번째 근무지
    region3 = cb5.get()
    if (region3 == "세번째 근무지역 선택"):
        region3 = ""
    sRegion3 = cb06.get()
    if (sRegion3 == "세번째 근무지역 세부 선택"):
        sRegion3 = ""

    # 첫번째 산업(세부 빼고 필수)
    business1 = cb7.get()
    business2 = cb08.get()
    if (business2 == "세부 산업/업종 선택"):
        business2 = ""

    # 두번째 산업
    business3 = cb9.get()
    if (business3 == "산업/업종 선택"):
        business3 = ""
    business4 = cb010.get()
    if (business4 == "세부 산업/업종 선택"):
        business4 = ""

    # 첫번째 근무형태
    workType = cb11.get()
    if (workType == "근무형태 선택"):
        workType = ""

    # 두번째 근무형태
    workType2 = cb12.get()
    if (workType2 == "근무형태 선택"):
        workType2 = ""

    # 학력선택
    edu = cb13.get()
    if (edu == "학력선택"):
        edu = ""

    # 키워드
    keyW = keyword.get()
    if (keyW == "키워드"):
        keyW = ""

    """(k, sR1, sR2, sR3, b, sB, b2, sB2, wT1, wT2, edu)"""

    if (region1 == "첫번째 근무지역 선택" or len(region1) == 0):
        tkinter.messagebox.showwarning('필수 항목 미선택', '최소 한 곳 이상의 지역을 선택해주세요.')
    elif (business1 == '산업/업종 선택' or len(business1) == 0):
        tkinter.messagebox.showwarning('필수 항목 미선택', '최소 한 개 이상의 산업 / 업종을 선택하세요.')
    else:
        tkinter.messagebox.showinfo('OK', '검색을 시작합니다.')
        main.startMyJob(keyW, sRegion1, sRegion2, sRegion3, business1, business2, business3,
                        business4, workType, workType2, edu)


# 첫번째 근무지역 선택
cb1_list = ["서울", "경기", "인천", "부산", "대구", "광주", "대전", "울산", "세종", "강원", "경남", "경북", "전남", "전북", "충남", "충북", "제주"]
cb1 = Combobox(win)
cb1.config(values=cb1_list)
cb1.insert(0, "첫번째 근무지역 선택")


def clear(event):
    if cb1.get() == "첫번째 근무지역 선택":
        cb1.delete(0, len(cb1.get()))


cb1.bind("<Button-1>", clear)
cb1.config(width=25, height=20)
cb1.place(x=8, y=110)

# 첫번째 근무지역 세부선택
cb02 = Combobox(win)


def choose(cb01_text):
    if cb01_text == "서울":
        cb02_list = ["서울 전체", "강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구",
                     "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중량구"]
    elif cb01_text == "경기":
        cb02_list = ["경기 전체", "가평군", "고양시", "고양시 덕양구", "고양시 일산동구", "고양시 일산서구", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시",
                     "동두천시", "부천시", "부천시 소사구", "부천시 오정구", "부천시 원미구", "서암시", "성남시 분당구", "성남시 수정구", "성남시 중원구", "수원시",
                     "수원시 권선구", "수원시 영통구", "수원시 장안구", "수원시 팔달구", "시흥시", "안산시"
            , "안산시 단원구", "안산시 상록구", "안성시", "안양시", "안양시 동안구", "안양시 만안구", "양주시", "양평군", "여주시", "연천군", "오산시", "용인시",
                     "용인시 기흥구", "용인시 수지구", "용인시 처인구", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"]
    elif cb01_text == "인천":
        cb02_list = ["인천 전체", "강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군", "중구"]
    elif cb01_text == "부산":
        cb02_list = ["부산 전체", "강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구",
                     "중구", "해운대구"]
    elif cb01_text == "대구":
        cb02_list = ["대구 전체", "남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"]
    elif cb01_text == "광주":
        cb02_list = ["광주 전체", "광산구", "남구", "동구", "북구", "서구"]
    elif cb01_text == "대전":
        cb02_list = ["대전 전체", "대덕구", "동구", "서구", "유성구", "중구"]
    elif cb01_text == "울산":
        cb02_list = ["울산 전체", "남구", "동구", "북구", "울주군", "중구"]
    elif cb01_text == "세종":
        cb02_list = ["세종특별자치시"]
    elif cb01_text == "강원":
        cb02_list = ["강원 전체", "강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시",
                     "평창군", "홍천군", "화천군", "횡성군"]
    elif cb01_text == "경남":
        cb02_list = ["경남 전체", "거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원시",
                     "창원시 마산합포구", "창원시 마산회원구", "창원시 성산구", "창원시 의창구", "창원시 진해구", "통영시", "하동군", "함안군", "함양군", "합천군"]
    elif cb01_text == "경북":
        cb02_list = ["경북 전체", "경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시",
                     "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시", "포항시 남구", "포항시 북구"]
    elif cb01_text == "전남":
        cb02_list = ["전남 전체", "강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군",
                     "염안군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"]
    elif cb01_text == "전북":
        cb02_list = ["전북 전체", "고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시", "전주시 덕진구",
                     "전주시 완산구", "정읍시", "진안군"]
    elif cb01_text == "충남":
        cb02_list = ["충남 전체", "계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "연기군", "예산군", "천안시",
                     "천안시 동남구", "천안시 서북구", "청양군", "태안군", "홍성군"]
    elif cb01_text == "충북":
        cb02_list = ["충북 전체", "괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청원군", "청주시", "청주시 상당구", "청주시 서원구",
                     "청주시 청원구", "청주시 흥덕구", "충주시"]
    elif cb01_text == "제주":
        cb02_list = ["제주 전체", "서귀포시", "제주시"]
    return cb02_list


cb02.insert(0, "첫번째 근무지역 세부 선택")


def clear(event):
    cb01_text = cb1.get()
    cb2_list = choose(cb01_text)
    cb02.delete(0, len(cb02.get()))
    cb02.config(values=cb2_list)


cb02.bind("<Button-1>", clear)
cb02.config(width=25, height=20)
cb02.place(x=8, y=140)

# 두번째 근무지역 선택
cb3_list = ["서울", "경기", "인천", "부산", "대구", "광주", "대전", "울산", "세종", "강원", "경남", "경북", "전남", "전북", "충남", "충북", "제주"]
cb3 = Combobox(win)
cb3.config(values=cb1_list)
cb3.insert(0, "두번째 근무지역 선택")


def clear(event):
    if cb3.get() == "두번째 근무지역 선택":
        cb3.delete(0, len(cb3.get()))


cb3.bind("<Button-1>", clear)
cb3.config(width=25, height=20)
cb3.place(x=8, y=170)

# 두번째 근무지역 세부선택
cb04 = Combobox(win)


def choose(cb03_text):
    if cb03_text == "서울":
        cb04_list = ["서울 전체", "강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구",
                     "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중량구"]
    elif cb03_text == "경기":
        cb04_list = ["경기 전체", "가평군", "고양시", "고양시 덕양구", "고양시 일산동구", "고양시 일산서구", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시",
                     "동두천시", "부천시", "부천시 소사구", "부천시 오정구", "부천시 원미구", "서암시", "성남시 분당구", "성남시 수정구", "성남시 중원구", "수원시",
                     "수원시 권선구", "수원시 영통구", "수원시 장안구", "수원시 팔달구", "시흥시", "안산시"
            , "안산시 단원구", "안산시 상록구", "안성시", "안양시", "안양시 동안구", "안양시 만안구", "양주시", "양평군", "여주시", "연천군", "오산시", "용인시",
                     "용인시 기흥구", "용인시 수지구", "용인시 처인구", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"]
    elif cb03_text == "인천":
        cb04_list = ["인천 전체", "강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군", "중구"]
    elif cb03_text == "부산":
        cb04_list = ["부산 전체", "강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구",
                     "중구", "해운대구"]
    elif cb03_text == "대구":
        cb04_list = ["대구 전체", "남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"]
    elif cb03_text == "광주":
        cb04_list = ["광주 전체", "광산구", "남구", "동구", "북구", "서구"]
    elif cb03_text == "대전":
        cb04_list = ["대전 전체", "대덕구", "동구", "서구", "유성구", "중구"]
    elif cb03_text == "울산":
        cb04_list = ["울산 전체", "남구", "동구", "북구", "울주군", "중구"]
    elif cb03_text == "세종":
        cb04_list = ["세종특별자치시"]
    elif cb03_text == "강원":
        cb04_list = ["강원 전체", "강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시",
                     "평창군", "홍천군", "화천군", "횡성군"]
    elif cb03_text == "경남":
        cb04_list = ["경남 전체", "거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원시",
                     "창원시 마산합포구", "창원시 마산회원구", "창원시 성산구", "창원시 의창구", "창원시 진해구", "통영시", "하동군", "함안군", "함양군", "합천군"]
    elif cb03_text == "경북":
        cb04_list = ["경북 전체", "경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시",
                     "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시", "포항시 남구", "포항시 북구"]
    elif cb03_text == "전남":
        cb04_list = ["전남 전체", "강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군",
                     "염안군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"]
    elif cb03_text == "전북":
        cb04_list = ["전북 전체", "고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시", "전주시 덕진구",
                     "전주시 완산구", "정읍시", "진안군"]
    elif cb03_text == "충남":
        cb04_list = ["충남 전체", "계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "연기군", "예산군", "천안시",
                     "천안시 동남구", "천안시 서북구", "청양군", "태안군", "홍성군"]
    elif cb03_text == "충북":
        cb04_list = ["충북 전체", "괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청원군", "청주시", "청주시 상당구", "청주시 서원구",
                     "청주시 청원구", "청주시 흥덕구", "충주시"]
    elif cb03_text == "제주":
        cb04_list = ["제주 전체", "서귀포시", "제주시"]
    return cb04_list


cb04.insert(0, "두번째 근무지역 세부 선택")


def clear(event):
    cb03_text = cb3.get()
    cb4_list = choose(cb03_text)
    cb04.delete(0, len(cb04.get()))
    cb04.config(values=cb4_list)


cb04.bind("<Button-1>", clear)
cb04.config(width=25, height=20)
cb04.place(x=8, y=200)

# 세번째 근무지역 선택
cb5_list = ["서울", "경기", "인천", "부산", "대구", "광주", "대전", "울산", "세종", "강원", "경남", "경북", "전남", "전북", "충남", "충북", "제주"]
cb5 = Combobox(win)
cb5.config(values=cb5_list)
cb5.insert(0, "세번째 근무지역 선택")


def clear(event):
    if cb5.get() == "세번째 근무지역 선택":
        cb5.delete(0, len(cb5.get()))


cb5.bind("<Button-1>", clear)
cb5.config(width=25, height=20)
cb5.place(x=8, y=230)

# 세번째 근무지역 세부선택
cb06 = Combobox(win)


def choose(cb05_text):
    if cb05_text == "서울":
        cb06_list = ["서울 전체", "강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구",
                     "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중량구"]
    elif cb05_text == "경기":
        cb06_list = ["경기 전체", "가평군", "고양시", "고양시 덕양구", "고양시 일산동구", "고양시 일산서구", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시",
                     "동두천시", "부천시", "부천시 소사구", "부천시 오정구", "부천시 원미구", "서암시", "성남시 분당구", "성남시 수정구", "성남시 중원구", "수원시",
                     "수원시 권선구", "수원시 영통구", "수원시 장안구", "수원시 팔달구", "시흥시", "안산시"
            , "안산시 단원구", "안산시 상록구", "안성시", "안양시", "안양시 동안구", "안양시 만안구", "양주시", "양평군", "여주시", "연천군", "오산시", "용인시",
                     "용인시 기흥구", "용인시 수지구", "용인시 처인구", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"]
    elif cb05_text == "인천":
        cb06_list = ["인천 전체", "강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군", "중구"]
    elif cb05_text == "부산":
        cb06_list = ["부산 전체", "강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구",
                     "중구", "해운대구"]
    elif cb05_text == "대구":
        cb06_list = ["대구 전체", "남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"]
    elif cb05_text == "광주":
        cb06_list = ["광주 전체", "광산구", "남구", "동구", "북구", "서구"]
    elif cb05_text == "대전":
        cb06_list = ["대전 전체", "대덕구", "동구", "서구", "유성구", "중구"]
    elif cb05_text == "울산":
        cb06_list = ["울산 전체", "남구", "동구", "북구", "울주군", "중구"]
    elif cb05_text == "세종":
        cb06_list = ["세종특별자치시"]
    elif cb05_text == "강원":
        cb06_list = ["강원 전체", "강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시",
                     "평창군", "홍천군", "화천군", "횡성군"]
    elif cb05_text == "경남":
        cb06_list = ["경남 전체", "거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원시",
                     "창원시 마산합포구", "창원시 마산회원구", "창원시 성산구", "창원시 의창구", "창원시 진해구", "통영시", "하동군", "함안군", "함양군", "합천군"]
    elif cb05_text == "경북":
        cb06_list = ["경북 전체", "경산시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시",
                     "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시", "포항시 남구", "포항시 북구"]
    elif cb05_text == "전남":
        cb06_list = ["전남 전체", "강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군",
                     "염안군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"]
    elif cb05_text == "전북":
        cb06_list = ["전북 전체", "고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시", "전주시 덕진구",
                     "전주시 완산구", "정읍시", "진안군"]
    elif cb05_text == "충남":
        cb06_list = ["충남 전체", "계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "연기군", "예산군", "천안시",
                     "천안시 동남구", "천안시 서북구", "청양군", "태안군", "홍성군"]
    elif cb05_text == "충북":
        cb06_list = ["충북 전체", "괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청원군", "청주시", "청주시 상당구", "청주시 서원구",
                     "청주시 청원구", "청주시 흥덕구", "충주시"]
    elif cb05_text == "제주":
        cb06_list = ["제주 전체", "서귀포시", "제주시"]
    return cb06_list


cb06.insert(0, "세번째 근무지역 세부 선택")


def clearr(event):
    cb05_text = cb5.get()
    cb6_list = choose(cb05_text)
    cb06.delete(0, len(cb06.get()))
    cb06.config(values=cb6_list)


cb06.bind("<Button-1>", clearr)
cb06.config(width=25, height=20)
cb06.place(x=8, y=260)

# 산업/업종 선택_1
cb7_list = ["서비스업", "제조·화학", "IT·웹 통신", "은행·금융업", "미디어·디자인", "교육업", "의료·제약·복지", "판매·유통", "건설업", "기관·협회"]
cb7 = Combobox(win)
cb7.config(values=cb7_list)
cb7.insert(0, "산업/업종 선택")


def clear(event):
    if cb7.get() == "산업/업종 선택":
        cb7.delete(0, len(cb7.get()))


cb7.bind("<Button-1>", clear)
cb7.config(width=25, height=20)
cb7.place(x=8, y=300)

# 세부 산업/업종 선택_1
cb08 = Combobox(win)


def choice(cb07_text):
    if cb07_text == "서비스업":
        cb08_list = ["호텔·여행·항공", "외식업·식음료", "웨딩·장례·이벤트", "AS·카센터·주유", "뷰티·미용", "시설관리·경비·용역", "레저·스포츠·여가", "렌탈·임대",
                     "기타서비스업"]
    elif cb07_text == "제조·화학":
        cb08_list = ["전기·전자·제어", "석유·화학·에너지", "식품가공·개발", "반도체·광학·LCD", "섬유·의류·패션", "환경", "농업·어업·광업·임업", "기계·설비·자동차",
                     "가구·목재·제지", "조선·항공·우주", "화장품·뷰티", "금속·재료·철강·요업", "생활용품·소비재·사무", "기타제조업"]
    elif cb07_text == "IT·웹 통신":
        cb08_list = ["웹에이젼시", "포털·인터넷·컨텐츠", "쇼핑몰·오픈마켓", "네트워크·통신·모바일", "하드웨어·장비", "정보보안·백신", "솔루션·SI·ERP·CRM", "IT컨설팅",
                     "게임"]
    elif cb07_text == "은행·금융업":
        cb08_list = ["은행·금융·저축", "대출·캐피탈·여신", "기타금융", "증권·보험·카드"]
    elif cb07_text == "미디어·디자인":
        cb08_list = ["신문·잡지·언론사", "방송사·케이블", "연예·엔터테인먼트", "광고·홍보·전시", "영화·배급·음악", "공연·예술·문화", "출판·인쇄·사진", "캐릭터·애니메이션",
                     "디자인·설계"]
    elif cb07_text == "교육업":
        cb08_list = ["초중고·대학", "유아·유치원", "교재·학습지", "학원·어학원", "전문·기능학원"]
    elif cb07_text == "의료·제약·복지":
        cb08_list = ["의료(진료과목별)", "의료(병원종류별)", "제약·보건·바이오", "사회복지"]
    elif cb07_text == "판매·유통":
        cb08_list = ["판매(매장종류별)", "판매(상품품목별)", "유통·무역·상사", "운송·운수·물류"]
    elif cb07_text == "건설업":
        cb08_list = ["건설·건축·토목·시공", "실내·인테리어·조경", "환경·설비", "부동산·임대·중개"]
    elif cb07_text == "기관·협회":
        cb08_list = ["정부·공공기관·공기업", "협회·단체", "법률·법무·특허", "세무·회계", "연구소·컨설팅·조사"]
    return cb08_list


cb08.insert(0, "세부 산업/업종 선택")


def clear(event):
    cb07_text = cb7.get()
    cb8_list = choice(cb07_text)
    cb08.delete(0, len(cb08.get()))
    cb08.config(values=cb8_list)


cb08.bind("<Button-1>", clear)
cb08.config(width=25, height=20)
cb08.place(x=8, y=330)

# 산업/업종 선택_2
cb9_list = ["서비스업", "제조·화학", "IT·웹 통신", "은행·금융업", "미디어·디자인", "교육업", "의료·제약·복지", "판매·유통", "건설업", "기관·협회"]
cb9 = Combobox(win)
cb9.config(values=cb7_list)
cb9.insert(0, "산업/업종 선택")


def clear(event):
    if cb9.get() == "산업/업종 선택":
        cb9.delete(0, len(cb7.get()))


cb9.bind("<Button-1>", clear)
cb9.config(width=25, height=20)
cb9.place(x=8, y=360)

# 세부 산업/업종 선택_2
cb010 = Combobox(win)


def choice(cb09_text):
    if cb09_text == "서비스업":
        cb010_list = ["호텔·여행·항공", "외식업·식음료", "웨딩·장례·이벤트", "AS·카센터·주유", "뷰티·미용", "시설관리·경비·용역", "레저·스포츠·여가", "렌탈·임대",
                     "기타서비스업"]
    elif cb09_text == "제조·화학":
        cb010_list = ["전기·전자·제어", "석유·화학·에너지", "식품가공·개발", "반도체·광학·LCD", "섬유·의류·패션", "환경", "농업·어업·광업·임업", "기계·설비·자동차",
                     "가구·목재·제지", "조선·항공·우주", "화장품·뷰티", "금속·재료·철강·요업", "생활용품·소비재·사무", "기타제조업"]
    elif cb09_text == "IT·웹 통신":
        cb010_list = ["웹에이젼시", "포털·인터넷·컨텐츠", "쇼핑몰·오픈마켓", "네트워크·통신·모바일", "하드웨어·장비", "정보보안·백신", "솔루션·SI·ERP·CRM", "IT컨설팅",
                     "게임"]
    elif cb09_text == "은행·금융업":
        cb010_list = ["은행·금융·저축", "대출·캐피탈·여신", "기타금융", "증권·보험·카드"]
    elif cb09_text == "미디어·디자인":
        cb010_list = ["신문·잡지·언론사", "방송사·케이블", "연예·엔터테인먼트", "광고·홍보·전시", "영화·배급·음악", "공연·예술·문화", "출판·인쇄·사진", "캐릭터·애니메이션",
                     "디자인·설계"]
    elif cb09_text == "교육업":
        cb010_list = ["초중고·대학", "유아·유치원", "교재·학습지", "학원·어학원", "전문·기능학원"]
    elif cb09_text == "의료·제약·복지":
        cb010_list = ["의료(진료과목별)", "의료(병원종류별)", "제약·보건·바이오", "사회복지"]
    elif cb09_text == "판매·유통":
        cb010_list = ["판매(매장종류별)", "판매(상품품목별)", "유통·무역·상사", "운송·운수·물류"]
    elif cb09_text == "건설업":
        cb010_list = ["건설·건축·토목·시공", "실내·인테리어·조경", "환경·설비", "부동산·임대·중개"]
    elif cb09_text == "기관·협회":
        cb010_list = ["정부·공공기관·공기업", "협회·단체", "법률·법무·특허", "세무·회계", "연구소·컨설팅·조사"]
    return cb010_list


cb010.insert(0, "세부 산업/업종 선택")


def clear(event):
    global cb010_list
    cb09_text = cb9.get()
    cb10_list = choice(cb09_text)
    cb010.delete(0, len(cb010.get()))
    cb010.config(values=cb10_list)


cb010.bind("<Button-1>", clear)
cb010.config(width=25, height=20)
cb010.place(x=8, y=390)

# 근무형태 선택_1
cb11_list = ["정규직", "계약직", "아르바이트", "인턴직", "프리랜서", "파트", "위촉직", "파견직", "전임", "병역특례", "교육생", "해외취업"]
cb11 = Combobox(win)
cb11.config(values=cb11_list)
cb11.insert(0, "근무형태 선택")


def clear(event):
    if cb11.get() == "근무형태 선택":
        cb11.delete(0, len(cb7.get()))


cb11.bind("<Button-1>", clear)
cb11.config(width=25, height=20)
cb11.place(x=8, y=420)

# 근무형태 선택_2
cb12_list = ["정규직", "계약직", "아르바이트", "인턴직", "프리랜서", "파트", "위촉직", "파견직", "전임", "병역특례", "교육생", "해외취업"]
cb12 = Combobox(win)
cb12.config(values=cb12_list)
cb12.insert(0, "근무형태 선택")


def clear(event):
    if cb12.get() == "근무형태 선택":
        cb12.delete(0, len(cb12.get()))


cb12.bind("<Button-1>", clear)
cb12.config(width=25, height=20)
cb12.place(x=8, y=450)

# 학력선택
cb13_list = ["학력무관", "고등학교졸업", "대학졸업(2,3년)", "대학교졸업(4년)", "석사졸업", "박사졸업", "고등학교졸업이상", "대학졸업(2,3년)이상", "대학교졸업(4년)이상", "석사졸업이상"]
cb13 = Combobox(win)
cb13.config(values=cb13_list)
cb13.insert(0, "학력선택")


def clear(event):
    if cb13.get() == "학력선택":
        cb13.delete(0, len(cb13.get()))


cb13.bind("<Button-1>", clear)
cb13.config(width=25, height=20)
cb13.place(x=8, y=480)

# 키워드
keyword = Entry(win)
keyword.config(width=26)
keyword.insert(0, "키워드")


def clear(event):
    if keyword.get() == "키워드":
        keyword.delete(0, len(keyword.get()))


keyword.bind("<Button-1>", clear)
keyword.place(x=8, y=550)

# 검색 버튼
btn1 = Button(win)
btn1.config(text="검색", command=searching, width=25)
btn1.place(x=8, y=600)

win.mainloop()  # 창 열기
